<a href="https://colab.research.google.com/github/Antoni-Pietryga/machine-learning-bootcamp/blob/master/supervised/01_basics/03_feature_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import sklearn

#Zaladowanie danych

In [7]:
def fetch_financial_data(company='AMZN'):
    """
    This function fetches stock market quotations
    """
    import pandas_datareader.data as web
    return web.DataReader(name=company,data_source='stooq')
df_raw = fetch_financial_data()
df_raw.head()

               Open       High      Low    Close   Volume
Date
2020-04-29  2330.01  2391.8900  2310.00  2370.26  4500542
2020-04-28  2372.10  2373.5000  2306.00  2314.08  5269446
2020-04-27  2443.20  2444.8800  2363.00  2376.00  5645645
2020-04-24  2417.00  2420.4332  2382.00  2410.22  3831797
2020-04-23  2399.98  2424.2200  2382.08  2399.45  5066552

In [8]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2020-04-29 to 2020-04-23
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

In [9]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

               Open       High      Low    Close   Volume  day  month  year
Date
2020-04-29  2330.01  2391.8900  2310.00  2370.26  4500542   29      4  2020
2020-04-28  2372.10  2373.5000  2306.00  2314.08  5269446   28      4  2020
2020-04-27  2443.20  2444.8800  2363.00  2376.00  5645645   27      4  2020
2020-04-24  2417.00  2420.4332  2382.00  2410.22  3831797   24      4  2020
2020-04-23  2399.98  2424.2200  2382.08  2399.45  5066552   23      4  2020

#Deskretyzacja zmiennej ciągłej

In [15]:
df = pd.DataFrame(data={'height': [175.,178.5,185.,191.,184.5,183.,168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [16]:
df['heaight_cat'] = pd.cut(x=df.height,bins=3)
df

   height         heaight_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [18]:
df['heaight_cat'] = pd.cut(x=df.height,bins=(160,175,180,195))
df

   height heaight_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [19]:
df['heaight_cat'] = pd.cut(x=df.height,bins=(160,175,180,195),labels=['small','medium','heigh'])
df

   height heaight_cat
0   175.0       small
1   178.5      medium
2   185.0       heigh
3   191.0       heigh
4   184.5       heigh
5   183.0       heigh
6   168.0       small

In [20]:
pd.get_dummies(df,drop_first=True,prefix='height')

   height  height_medium  height_heigh
0   175.0              0             0
1   178.5              1             0
2   185.0              0             1
3   191.0              0             1
4   184.5              0             1
5   183.0              0             1
6   168.0              0             0

#Ekstracja cech

In [21]:
df = pd.DataFrame(data={'lang': [['PL','ENG'],['GER','ENG','PL','FRA'],['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [23]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [24]:
df['flag_PL'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  flag_PL
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [25]:
df = pd.DataFrame(data={'website': ['wp.pl','onet.pl','google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [28]:
df.website.str.split('.',expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [29]:
new = df.website.str.split('.',expand=True)
df['portal'] = new[0]
df['extansion'] = new[1]
df

      website  portal extansion
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com